# -*- coding:utf-8 -*-
'''
이 소스 컴퓨터에 전기신호로 바꿔서 저장할 때 utf-8방식으로
컴퓨터는 전자기계 -> 전기의 흐름밖에 표현할 줄 모름
모든 데이터는 전기의 흐름으로 (흐름 : 1, 안흐름 : 0)
ㅋ -encoding -> 1101 -decoding - ㅋㅋㅋ
방식은 여러가지가 있는데 전세계적으로 utf-8을 많이 사용
'''

# 주석 (comment) : 실행할 때 무시    '''여러줄 주석'''
print("abc")

# 자주 사용하는 단축키 정리
# ctrl + space : 소스 자동완성
# ctrl + F11 : 실행 RUN
# ctrl + /(slash) : 주석처리 
# ctrl + d : 줄 삭제
# ctrl + alt + 화살표 (위/아래) : 줄 복사
# ctrl + shift + f : 가독성 좋게 소스 정리

# alt + 화살표 (위/아래) : 소스 위치 이동
# alt + 화살표 (좌/우) : 이전 파일로 이동

# 용어 정리
# / slash
# \ (back-slash)

# : colon
# ; semi-colon

# ' 작은 따옴표
# " 큰 따옴표

# , 쉼표
# . 마침표

a = 10 + 20 * 3 / 12

# print(a)
