# -*- coding:utf-8 -*-

# 일반적인 다른 프로그래밍 언어 문장 끝  ;
# Python 문장 끝  ; / 엔터 (둘 다 가능)
# 한줄에 여러개 넣을 경우 세미콜론 ; 을 넣어주면 인식

print("test"); print("ㅋㅋㅋ")  
print("test")  

# 다른 프로그래밍 언어는 들여쓰기와 띄어쓰기가 자유롭지만 
# Python은 들여쓰기가 문법적으로 의미가 있어서 안됨, 다른 결과가 나옴 
# 한국어(설계) -> 프로그래밍 언어(내가 코딩) -> 기계어(파이썬이 알아서 변환) -> 실행
# 컴퓨터 언어 : compiler방식, interpreter방식
# compiler 방식 : 전체를 한꺼번에 기계어로 번역해서 실행 (일반적으로 compiler방식)
#                    중간에 에러가 있으면 실행 안됨
# interpreter방식 : 한줄씩 기계어로 번역해서 실행  (python은 interpreter방식)
#                    대화식 처리(한줄씩 써서 테스트 가능) (장점)
#                    중간에 에러가 있어도 일단 실행 됨 -> 에러 잡기 힘듦 (단점)
#                    한줄씩 실행하기 때문에 속도가 느림 (단점)
# Python은 성능보다는 작업이 편하고 자유로움

print("zzzz")











